NordicPlayground/nrf528xx-ble-throughput-demo/ble_app_att_mtu_throughput/main.c
static const test_params_t ble_5_HS_version_params =
{
    .att_mtu                  = 247,
    .conn_interval            = MSEC_TO_UNITS(400, UNIT_1_25_MS),
    .data_len_ext_enabled     = true,
    .conn_evt_len_ext_enabled = true,
	.rxtx_phy                 = BLE_GAP_PHY_2MBPS,
	.tx_power				  = 8,	
};

static const test_params_t ble_5_LR_version_params =
{
    .att_mtu                  = 247,
    .conn_interval            = MSEC_TO_UNITS(50, UNIT_1_25_MS),
    .data_len_ext_enabled     = true,
    .conn_evt_len_ext_enabled = true,
	.rxtx_phy                 = BLE_GAP_PHY_CODED,
	.tx_power				  = 8,
};

static const test_params_t ble_4_2_version_params =
{
    .att_mtu                  = 247,
    .conn_interval            = MSEC_TO_UNITS(400, UNIT_1_25_MS),
    .data_len_ext_enabled     = true,
    .conn_evt_len_ext_enabled = true,
	.rxtx_phy                 = BLE_GAP_PHY_1MBPS,
	.tx_power				  = 4,
};

static const test_params_t ble_4_1_version_params =
{
    .att_mtu                  = 23,
    .conn_interval            = MSEC_TO_UNITS(7.5, UNIT_1_25_MS),
    .data_len_ext_enabled     = false,
    .conn_evt_len_ext_enabled = false,
	.rxtx_phy                 = BLE_GAP_PHY_1MBPS,
	.tx_power				  = 4,
};

void advertising_start(void);
void scan_start(void);
void test_params_print(void);
void display_test_params_print(void);
uint8_t button_read(void);
void buttons_enable(void);
void buttons_disable(void);
static void wait_for_event(void);
void menu_print(void);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}


/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    bsp_board_leds_init();
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timer_init(void)
{
    // Initialize timer module.
    APP_TIMER_INIT(TIMER_PRESCALER, TIMER_OP_QUEUE_SIZE, false);
}

/**@brief Function for initializing GAP parameters.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (uint8_t const*)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_ppcp_set(&m_conn_param);
    APP_ERROR_CHECK(err_code);

}

void test_run(bool wait_for_button)
{
	if(wait_for_button)
	{
		NRF_LOG_RAW_INFO("\r\n");
		NRF_LOG_INFO("Test is ready. Press any button to run.\r\n");
		NRF_LOG_FLUSH();
		
		display_print_line_inc("Test is ready. Press any button to run.");
		display_show();

		(void) button_read();
	}
	
	m_counter_started = false;
    nrf_ble_amts_notif_spam(&m_amts);
	
	m_test_started = true;
	buttons_enable();
}

void terminate_test(void)
{
    m_run_test                 = false;
    m_notif_enabled            = false;
    m_mtu_exchanged            = false;
	m_phy_updated              = false;
    m_conn_interval_configured = false;
	m_test_started				= false;
	
	buttons_disable();
	
    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        NRF_LOG_INFO("Disconnecting.\r\n");
		
        ret_code_t ret = sd_ble_gap_disconnect(m_conn_handle,
            BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if (ret != NRF_SUCCESS)
        {
            NRF_LOG_ERROR("Disconnected returned 0x%0x", ret);
        }
    }
    else
    {
        if (m_board_role == BOARD_TESTER)
        {
            m_print_menu = true;
        }
        if (m_board_role == BOARD_DUMMY)
        {
			advertising_start();
        }
    }
}


/**@brief AMT Service Handler.
 */
static void amts_evt_handler(nrf_ble_amts_evt_t evt)
{
    ret_code_t  err_code;
    switch (evt.evt_type)
    {
        case SERVICE_EVT_NOTIF_ENABLED:
        {
            bsp_board_led_on(LED_READY);
            NRF_LOG_INFO("Notifications enabled.\r\n");
			display_print_line_inc("Notifications enabled.");
			m_display_show = true;
			
            m_notif_enabled = true;
            if (m_board_role == BOARD_TESTER)
            {
                if (m_gap_role == BLE_GAP_ROLE_PERIPH)
                {
                    m_conn_interval_configured = false;
                    m_conn_param.min_conn_interval = m_test_params.conn_interval;
                    m_conn_param.max_conn_interval = m_test_params.conn_interval+1;
                    err_code = ble_conn_params_change_conn_params(&m_conn_param);
                    if (err_code != NRF_SUCCESS)
                    {
                        NRF_LOG_ERROR("sd_ble_gap_conn_param_update returned 0x%x.\r\n", err_code);
                    }
                }
                if (m_gap_role == BLE_GAP_ROLE_CENTRAL)
                {
                    m_conn_interval_configured     = true;
                    m_conn_param.min_conn_interval = m_test_params.conn_interval;
                    m_conn_param.max_conn_interval = m_test_params.conn_interval;
                    err_code = sd_ble_gap_conn_param_update(m_conn_handle,
                                                                       &m_conn_param);
                    if (err_code != NRF_SUCCESS)
                    {
                        NRF_LOG_ERROR("sd_ble_gap_conn_param_update returned 0x%x.\r\n", err_code);
                    }
                }
            }
        } break;

        case SERVICE_EVT_NOTIF_DISABLED:
            bsp_board_led_off(LED_READY);
            NRF_LOG_INFO("Notifications disabled.\r\n");
            break;

        case SERVICE_EVT_TRANSFER_1KB:
        {
			m_transfer_data.counter_ticks = counter_get();
			m_transfer_data.bytes_transfered = evt.bytes_transfered_cnt;
			m_display_show_transfer_data = true;
            bsp_board_led_invert(LED_PROGRESS);
			
			//update rssi data
			int8_t rssi;
			err_code = sd_ble_gap_rssi_get(m_conn_handle, &rssi);
			if(err_code == NRF_SUCCESS)
			{
				if(m_rssi_data.nr_of_samples == 0)
				{
					m_rssi_data.moving_average = rssi;
				}
				else
				{
					m_rssi_data.moving_average = 
							(float)m_rssi_data.moving_average * RSSI_MOVING_AVERAGE_ALPHA
							+ (float)rssi * (1.0 - RSSI_MOVING_AVERAGE_ALPHA);
				}
				
				m_rssi_data.sum += rssi;
				m_rssi_data.nr_of_samples++;
				m_rssi_data.current_rssi = rssi;
				//check in case the RSSI value magically drops below the spec
				if( (-m_rssi_data.moving_average) > m_test_params.link_budget)
				{
					m_rssi_data.link_budget = 0;
				}
				else
				{
					m_rssi_data.link_budget = m_test_params.link_budget + m_rssi_data.moving_average;
				}
				
				m_rssi_data.range_multiplier = pow(10.0, (double)m_rssi_data.link_budget/20.0);
				
				NRF_LOG_INFO("RSSI: %d\r\n", rssi);
				NRF_LOG_INFO("MA_RSSI: %d\r\n", m_rssi_data.moving_average);
			}
			
