NordicPlayground/nrf528xx-ble-throughput-demo/ble_app_att_mtu_throughput/main.c
    if (m_board_role == BOARD_TESTER)
    {
        scan_start();
    }
    if (m_board_role == BOARD_DUMMY)
    {
        advertising_start();
    }
}


void menu_print(void)
{
    bool begin_test = false;

    while (!begin_test)
    {
		display_clear();
        test_params_print();
		display_test_params_print();
		
        NRF_LOG_INFO("Select an option:\r\n");
        NRF_LOG_INFO(" 1) Run single transfer.\r\n");
		NRF_LOG_INFO(" 2) Run continuous transfer.\r\n");
        NRF_LOG_INFO(" 3) Adjust test parameters.\r\n");
		NRF_LOG_INFO(" 4) Adjust for bluetooth version.\r\n");
        NRF_LOG_FLUSH();

        display_print_line_inc(" 1) Run single transfer.");
		display_print_line_inc(" 2) Run continuous transfer.");
        display_print_line_inc(" 3) Adjust test parameters.");
		display_print_line_inc(" 4) Adjust for bluetooth version.");
		display_show();
		
        switch (button_read())
        {
            case BUTTON_1:
                begin_test = true;
				m_test_continuous = false;
                test_begin();
                break;

			case BUTTON_2:
                begin_test = true;
				m_test_continuous = true;
                test_begin();
                break;
			
            case BUTTON_3:
                test_param_adjust();
                break;
			
			case BUTTON_4:
                test_param_adjust_ble_version();
                break;
        }
    }

	m_transfer_data.last_throughput = 0;
	memset(&m_rssi_data, 0, sizeof(m_rssi_data));
	m_rssi_data.max = -128;
    m_print_menu = false;
}


static bool is_test_ready()
{
    if (   (m_board_role == BOARD_TESTER)
        && m_conn_interval_configured
        && m_notif_enabled
        && m_mtu_exchanged
        && m_phy_updated
        && !m_run_test)
    {
        return true;
    }
    return false;
}

int main(void)
{
    log_init();
	
	display_init();
	
    leds_init();
    timer_init();
    counter_init();
	
	buttons_init(buttons);

    ble_stack_init();
	
	sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
	
    gap_params_init();
    conn_params_init();
    gatt_init();
    advertising_data_set();

    server_init();
    client_init();

    gatt_mtu_set(m_test_params.att_mtu);
    data_len_ext_set(m_test_params.data_len_ext_enabled);
    conn_evt_len_ext_set(m_test_params.conn_evt_len_ext_enabled);
	
	tx_power_set(m_test_params.tx_power);
	
    NRF_LOG_INFO("ATT MTU example started.\r\n");
    NRF_LOG_INFO("Press button 1 on the board connected to the PC.\r\n");
    NRF_LOG_INFO("Press button 2 on other board.\r\n");
    NRF_LOG_FLUSH();
	
	display_clear();
    display_print_line_inc("- Press button 1 on this board");
    display_print_line_inc("- Press button 2 on other board.");
	display_show();

    uint8_t button = button_read();

	if(button == BUTTON_1)
	{
		m_board_role = BOARD_TESTER;
		preferred_phy_set(m_test_params.rxtx_phy);
		m_print_menu = true;
	}
	else
	{
		m_board_role = BOARD_DUMMY;
		preferred_phy_set(BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_CODED);
		advertising_start();
	}

    for (;;)
    {
		if(m_transfer_done)
		{
			display_test_done_screen(&m_transfer_data, &m_rssi_data);
			
			button_read();
			m_transfer_done = false;
		}
		
        if (m_print_menu && !m_transfer_done)
        {
            menu_print();
        }

        if (is_test_ready())
        {
            m_run_test = true;
            test_run(!m_test_continuous);
        }

		if(m_display_show_transfer_data)
		{
			display_draw_test_run_screen(&m_transfer_data, &m_rssi_data);
			m_display_show_transfer_data = false;
		}
		
		if(m_display_show)
		{
			display_show();
			m_display_show = false;
		}
		
        if (!NRF_LOG_PROCESS())
        {
            wait_for_event();
        }
    }
}


/**
 * @}
 */
